tutorials/immersedBoundary/Test/0/T
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.4                                   |
|   \\  /    A nd           | Web:      http://www.openfoam.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version         2.0;
    format          ascii;

    root            "";
    case            "";
    instance        "";
    local           "";

    class           volScalarField;
    object          T;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


dimensions [0 0  0 1 0 0 0];

internalField uniform 0;

boundaryField
{
    ibCylinder
    {
        type mixedTempIb;
        patchType immersedBoundary;
        triValue uniform 0;
        triGradient  uniform 0;
        triValueFraction uniform 1;
        value uniform 0;

        setDeadValue   no;
        deadValue      0;
    }

    in
    {
        type fixedValue;
        value uniform 1;
    }

    out
    {
        type zeroGradient;
    }

    top
    {
        type zeroGradient;
    }

    bottom
    {
        type zeroGradient;
    }

    frontAndBack
    {
        type empty;
    }
}


// ************************************************************************* //
